# DeleteWorksetSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DeleteWorksetSettings Properties
DeleteWorksetSettings Class See Also
---
The DeleteWorksetSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DeleteWorksetOption | The current delete workset option. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| WorksetId | The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset. |

# See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace